# Напишите программу, которая принимает на вход цифру, обозначающую день недели,
# и проверяет, является ли этот день выходным.
# Пример:
# - 6 -> да
# - 7 -> да
# - 1 -> нет

number = int(input())

if number == 1:
    print(f'Да - {number}')
elif number == 2:
    print(f'Да - {number}')
elif number == 3:
    print(f'Да - {number}')
elif number == 4:
    print(f'Да - {number}')
elif number == 5:
    print(f'Да - {number}')
elif number == 6:
    print(f'Нет - {number}')
elif number == 7:
    print(f'Нет - {number}')
else:
    print('Число не подходит')
